app/Views/layout/template.php

SELECT *
FROM `app_menu`
WHERE `status` = 1
AND `id` IN ('1','2','3','6','5','8','4','7')
ORDER BY `posisi` ASC
---
$akses_menu = $this->db->query("SELECT * FROM akses_menu WHERE id_user = '$id'")->getRow();

$main_menu = explode(',', $akses_menu->menu);
$main_menu = $this->db->table("app_menu")->where('status', 1)->whereIn('id', $main_menu)->orderBy('posisi', 'ASC')->get()->getResult();

SELECT *
FROM `app_child_menu`
WHERE `id` IN ('1','2','23','3','4','5','10','11','14','15','25','9','12','13','26','27','28','17','18','19','6','22','24','8')
AND `id_app_menu` = '2'
AND `status` = 1
ORDER BY `posisi` ASC
---

                        <?php foreach ($main_menu as $key) : ?>
                            <?php if ($key->has_child == 1) {
                                $sub = $this->db->table("app_child_menu")->whereIn('id', $child)->where('id_app_menu', $key->id)->where('status', 1)->orderBy('posisi', 'ASC')->get()->getResult(); ?>